Revit 2026 API

# TilePatterns Properties

---

The TilePatterns type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |

#### Reference

TilePatterns Class

Autodesk.Revit.DB Namespace